#Задача 2: Найдите сумму цифр трехзначного числа.
#Пример:
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0)

a = int(input("введите число "))
suma=0

while a > 0:
    digit = a % 10
    suma = suma + digit
    a = a // 10
 
print("Сумма:", suma)